In [1]:
import pandas as pd
import numpy as np

In [2]:
%pwd
# 현재 작업하는 곳(디렉토리)의 위치를 보여줌

'C:\\python\\2023.03.07_pandas2'

In [3]:
# % cd C:\\python\\2023.03.07_pandas2
# 위 꼴을 작성하면 작성한 디렉토리로 이동한다.

# "datas/sample1.csv" 형태로 쓰면 해당 경로로 파일이 읽거나 써진다.

# Pandas 데이터 입출력

In [4]:
# Pandas는 데이터 파일을 읽어 Series 혹은 DataFrame 생성 가능

## CSV 포맷 입출력

In [5]:
# CSV는 데이터 값이 콤마(comma)로 구분되는 텍스트 파일

In [6]:
# CSV 파일 예시

# 연도,제조사,모델,설명,가격
# 1997,Ford,E350,"ac, abs, moon",3000.00
# 1999,Chevy,"Venture ""Extended Edition""","",4900.00
# 1999,Chevy,"Venture ""Extended Edition, Very Large""",,5000.00
# 1996,Jeep,Grand Cherokee,"MUST SELL!air, moon roof, loaded",4799.00

# Pandas 데이터 출력

In [7]:
data = {
    "c1" : [1, 2, "누락"],
    "c2" : [1.11, "", 3.33],
    "c3" : ["one", "two", "three"]
}
df_csv = pd.DataFrame(data)
df_csv

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [8]:
# pandas 데이터를 csv 파일로 출력할 때 to_csv() 메서드 활용

# DataFrame.to_csv(path_or_buf = None, sep = ',', na_rep = '',
#                  float_format = None, columns = None, header = True,
#                  index = True, index_lable = None, mode = 'w',
#                  encoding = None, compression = 'infer',
#                  quoting = None, quotechar = '"',
#                  lineterminator = None, chuncksize = None,
#                  date_format = None, doublequote = True,
#                  escapechar = None, decimal = '.',
#                  error = 'strict', storage_options = None)

# 첫 인자로는 파일 경로 입력
# index의 default 값은  True이니 imdex를 굳이 안 쓸 때 
# index = Fasle 입력

In [9]:
df_csv.to_csv("sample1.csv", index = False)

In [10]:
# 모든 인덱스 제거 후 저장(value값만 저장)

df_csv.to_csv("sample2.csv", index = False, header = False)
# index는 row index
# header는 column index

# Pandas 데이터 입력

In [11]:
# read_csv() 메서드 활용
df_read = pd.read_csv("sample1.csv")
df_read # row index 정보가 없으므로 row index는 0부터 자동으로 시작

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [12]:
#  names 키워드를 통해 column 인덱스 추가
pd.read_csv("sample2.csv", names = ['c1', 'c2', 'c3'])

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

# 콤마가 아닌 텍스트 파일 처리

In [13]:
# %%writefile 파일명은 jupyter lab의 매직 명령어다.
# 이를 통해 파일을 저장 가능

# 명령어를 쓸 때 반드시 첫 줄에 있어야 실행된다.

In [14]:
%%writefile sample3.txt
c1 c2 c3 c4
0.179181 -1.538472 1.347553 0.43381
1.024209 0.087307 -1.281997 0.49265
0.417899 -2.002308 0.255245 -1.10515

Overwriting sample3.txt

In [15]:
# sep 인수를 통해 구분자(seperator)를 사용자가 지정

# 만약 길이가 정해지지 않은 공백이 구분자인 경우에는
# '\s+' 정규식(regular expression) 문자열을 사용하면 된다.
# \s는 공백, +는 한칸 이상의 것을 의미한다.

In [16]:
pd.read_table('sample3.txt', sep = '\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [17]:
# 부가적인 텍스트 정보가 포함된 csv

In [18]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample4.txt

In [19]:
# 데이터를 불러올 파일 중에 건너 뛰어야 할 행이 있다면 skiprow 인수 사용

# 리스트가 아닌 range()를 활용해도 됨

# pd.read_csv("sample4.txt", skiprows = [0, 1])
pd.read_csv("sample4.txt", skiprows = range(2))

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

# 자료 내부 특정한 값을 NaN 변경하는 방법

In [20]:
# na_values인수에 NaN값으로 취급할 값 입력

df_na_val = pd.read_csv('sample1.csv', na_values = ['누락'])
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

# csv 생성 시 구분자 지정

In [21]:
# 파일을 읽을 때와 마찬가지로 파일을 출력할 때도 
# sep 인수로 구분자 변경 가능

df_na_val.to_csv('sample5.txt', sep = '|', index = False)

In [22]:
pd.read_csv('sample5.txt')

       c1|c2|c3
0  1.0|1.11|one
1      2.0||two
2   |3.33|three

In [23]:
pd.read_csv('sample5.txt', sep = '|')

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

# csv 생성 시 NaN 값에 값 넣기

In [24]:
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [25]:
# na_rep 인수를 통해 NaN 표시값 변경 가능
df_na_val.to_csv('sample6.csv', na_rep = '누락', index = False)

In [26]:
pd.read_csv("sample6.csv")

    c1    c2     c3
0  1.0  1.11    one
1  2.0    누락    two
2   누락  3.33  three

    # 온라인의 csv 파일 가져오기

In [27]:
# read_csv 명령 사용시 path 대신 URL을 지정하면 
# Pandas가 직접 해당 파일을 다운로드하여 읽어들인다.

titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")

In [28]:
titanic

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
...,...,...,...,...,...,...,...,...,...,...
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

In [29]:
titanic.describe()

         survived         age  n_siblings_spouses       parch        fare
count  627.000000  627.000000          627.000000  627.000000  627.000000
mean     0.387560   29.631308            0.545455    0.379585   34.385399
std      0.487582   12.511818            1.151090    0.792999   54.597730
min      0.000000    0.750000            0.000000    0.000000    0.000000
25%      0.000000   23.000000            0.000000    0.000000    7.895800
50%      0.000000   28.000000            0.000000    0.000000   15.045800
75%      1.000000   35.000000            1.000000    0.000000   31.387500
max      1.000000   80.000000            8.000000    5.000000  512.329200

In [30]:
titanic.head(3)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y

In [31]:
titanic.tail(3)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
624,1,female,19.0,0,0,30.00,First,B,Southampton,y
625,0,female,28.0,1,2,23.45,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.75,Third,unknown,Queenstown,y